#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.dynamodb-test.aws_dynamodb_table.users-table: Refreshing state... [id=goidc-users-test][0m
[0m[1mmodule.dynamodb-test.aws_dynamodb_table.clients-table: Refreshing state... [id=goidc-clients-test][0m
[0m[1mmodule.dynamodb-prod.aws_dynamodb_table.users-table: Refreshing state... [id=goidc-users-prod][0m
[0m[1mmodule.api.aws_s3_bucket.ui_bucket: Refreshing state... [id=goidc-authorize-ui][0m
[0m[1mmodule.dynamodb-dev.aws_dynamodb_table.clients-table: Refreshing state... [id=goidc-clients-dev][0m
[0m[1mmodule.dynamodb-dev.aws_dynamodb_table.users-table: Refreshing state... [id=goidc-users-dev][0m
[0m[1mmodule.dynamodb-prod.aws_dynamodb_table.clients-table: Refreshing state... [id=goidc-clients-prod][0m
[0m[1mmodule.api.aws_api_gateway_rest_api.api: Refreshing state... [id=g3n6hchln8][0m
[0m[1mmodule.api.aws_api_gateway_resource.api_proxy: Refreshing state... [id=yl26qc][0m
[0m[1mmodule.api.aws_api_gateway_resource.oauth_proxy: Refreshing state... [id=g48o4m][0m
[0m[1mmodule.api.aws_api_gateway_deployment.default: Refreshing state... [id=p3asba][0m
[0m[1mmodule.api.module.users_endpoints.aws_api_gateway_resource.users_proxy: Refreshing state... [id=xzg1re][0m
[0m[1mmodule.api.module.oauth_endpoints.aws_api_gateway_resource.authorize_proxy: Refreshing state... [id=ddzaw3][0m
[0m[1mmodule.api.module.oauth_endpoints.aws_api_gateway_resource.token_proxy: Refreshing state... [id=soyey9][0m
[0m[1mmodule.api.module.oauth_endpoints.module.generate_token.aws_iam_policy.logging: Refreshing state... [id=arn:aws:iam::784952278145:policy/generate-token-logging][0m
[0m[1mmodule.api.module.oauth_endpoints.module.generate_token.aws_iam_role.execution: Refreshing state... [id=generate-token-exec][0m
[0m[1mmodule.api.module.oauth_endpoints.aws_iam_policy.generate_token_kms: Refreshing state... [id=arn:aws:iam::784952278145:policy/generate-token-kms][0m
[0m[1mmodule.api.module.oauth_endpoints.aws_iam_policy.authorize_kms: Refreshing state... [id=arn:aws:iam::784952278145:policy/authorize-kms][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_get.aws_iam_role.execution: Refreshing state... [id=authorize-ui-exec][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_get.aws_iam_policy.logging: Refreshing state... [id=arn:aws:iam::784952278145:policy/authorize-ui-logging][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_post.aws_iam_policy.logging: Refreshing state... [id=arn:aws:iam::784952278145:policy/authorize-logging][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_post.aws_iam_role.execution: Refreshing state... [id=authorize-exec][0m
[0m[1mmodule.api.module.test_stage.aws_kms_key.jwt: Refreshing state... [id=3c1e9f08-3bdc-49f2-8b5d-a9e14710a409][0m
[0m[1mmodule.api.module.dev_stage.aws_kms_key.jwt: Refreshing state... [id=f1deec17-d1bc-48a5-b15b-50ecfc940e8e][0m
[0m[1mmodule.api.module.oauth_endpoints.module.generate_token.aws_api_gateway_method.method: Refreshing state... [id=agm-g3n6hchln8-soyey9-POST][0m
[0m[1mmodule.api.module.prod_stage.aws_kms_key.jwt: Refreshing state... [id=9d536f13-ffdb-4bd1-9501-a84abc3778a7][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_get.aws_api_gateway_method.method: Refreshing state... [id=agm-g3n6hchln8-ddzaw3-GET][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_post.aws_api_gateway_method.method: Refreshing state... [id=agm-g3n6hchln8-ddzaw3-POST][0m
[0m[1mmodule.api.module.users_endpoints.module.create_user.aws_iam_policy.logging: Refreshing state... [id=arn:aws:iam::784952278145:policy/create-user-logging][0m
[0m[1mmodule.api.module.users_endpoints.module.create_user.aws_iam_role.execution: Refreshing state... [id=create-user-exec][0m
[0m[1mmodule.api.module.users_endpoints.module.create_user.aws_api_gateway_method.method: Refreshing state... [id=agm-g3n6hchln8-xzg1re-POST][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_get.aws_lambda_function.function: Refreshing state... [id=authorize-ui][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_get.aws_iam_role_policy_attachment.logs_attachment: Refreshing state... [id=authorize-ui-exec-20210530101031547600000001][0m
[0m[1mmodule.api.module.oauth_endpoints.module.generate_token.aws_lambda_function.function: Refreshing state... [id=generate-token][0m
[0m[1mmodule.api.module.oauth_endpoints.module.generate_token.aws_iam_role_policy_attachment.logs_attachment: Refreshing state... [id=generate-token-exec-20210526200605366600000002][0m
[0m[1mmodule.api.module.oauth_endpoints.module.generate_token.aws_iam_role_policy_attachment.attachment[0]: Refreshing state... [id=generate-token-exec-20210526200605359600000001][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_post.aws_iam_role_policy_attachment.logs_attachment: Refreshing state... [id=authorize-exec-20210526200605411100000004][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_post.aws_lambda_function.function: Refreshing state... [id=authorize][0m
[0m[1mmodule.api.module.oauth_endpoints.module.generate_token.aws_api_gateway_method_response.ok: Refreshing state... [id=agmr-g3n6hchln8-soyey9-POST-200][0m
[0m[1mmodule.api.module.oauth_endpoints.module.generate_token.aws_api_gateway_integration.integration: Refreshing state... [id=agi-g3n6hchln8-soyey9-POST][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_post.aws_iam_role_policy_attachment.attachment[0]: Refreshing state... [id=authorize-exec-20210526200605386100000003][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_get.aws_api_gateway_method_response.ok: Refreshing state... [id=agmr-g3n6hchln8-ddzaw3-GET-200][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_get.aws_api_gateway_integration.integration: Refreshing state... [id=agi-g3n6hchln8-ddzaw3-GET][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_post.aws_api_gateway_integration.integration: Refreshing state... [id=agi-g3n6hchln8-ddzaw3-POST][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_post.aws_api_gateway_method_response.ok: Refreshing state... [id=agmr-g3n6hchln8-ddzaw3-POST-200][0m
[0m[1mmodule.api.module.users_endpoints.module.create_user.aws_api_gateway_integration.integration: Refreshing state... [id=agi-g3n6hchln8-xzg1re-POST][0m
[0m[1mmodule.api.module.users_endpoints.module.create_user.aws_api_gateway_method_response.ok: Refreshing state... [id=agmr-g3n6hchln8-xzg1re-POST-200][0m
[0m[1mmodule.api.module.users_endpoints.module.create_user.aws_iam_role_policy_attachment.attachment[0]: Refreshing state... [id=create-user-exec-20210602113724602000000001][0m
[0m[1mmodule.api.module.oauth_endpoints.module.generate_token.aws_api_gateway_integration_response.integration_response: Refreshing state... [id=agir-g3n6hchln8-soyey9-POST-200][0m
[0m[1mmodule.api.module.users_endpoints.module.create_user.aws_iam_role_policy_attachment.logs_attachment: Refreshing state... [id=create-user-exec-20210602113724622900000002][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_get.aws_api_gateway_integration_response.integration_response: Refreshing state... [id=agir-g3n6hchln8-ddzaw3-GET-200][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_get_dev.aws_lambda_permission.permission: Refreshing state... [id=AllowAPIGatewayInvoke][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_get_dev.aws_lambda_alias.alias: Refreshing state... [id=arn:aws:lambda:eu-west-2:784952278145:function:authorize-ui:dev][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_get_test.aws_lambda_permission.permission: Refreshing state... [id=AllowAPIGatewayInvoke][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_get_prod.aws_lambda_alias.alias: Refreshing state... [id=arn:aws:lambda:eu-west-2:784952278145:function:authorize-ui:prod][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_get_prod.aws_lambda_permission.permission: Refreshing state... [id=AllowAPIGatewayInvoke][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_get_test.aws_lambda_alias.alias: Refreshing state... [id=arn:aws:lambda:eu-west-2:784952278145:function:authorize-ui:test][0m
[0m[1mmodule.api.module.oauth_endpoints.module.generate_token_test.aws_lambda_alias.alias: Refreshing state... [id=arn:aws:lambda:eu-west-2:784952278145:function:generate-token:test][0m
[0m[1mmodule.api.module.oauth_endpoints.module.generate_token_prod.aws_lambda_alias.alias: Refreshing state... [id=arn:aws:lambda:eu-west-2:784952278145:function:generate-token:prod][0m
[0m[1mmodule.api.module.oauth_endpoints.module.generate_token_dev.aws_lambda_alias.alias: Refreshing state... [id=arn:aws:lambda:eu-west-2:784952278145:function:generate-token:dev][0m
[0m[1mmodule.api.module.oauth_endpoints.module.generate_token_test.aws_lambda_permission.permission: Refreshing state... [id=AllowAPIGatewayInvoke][0m
[0m[1mmodule.api.module.oauth_endpoints.module.generate_token_prod.aws_lambda_permission.permission: Refreshing state... [id=AllowAPIGatewayInvoke][0m
[0m[1mmodule.api.module.oauth_endpoints.module.generate_token_dev.aws_lambda_permission.permission: Refreshing state... [id=AllowAPIGatewayInvoke][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_post.aws_api_gateway_integration_response.integration_response: Refreshing state... [id=agir-g3n6hchln8-ddzaw3-POST-200][0m
[0m[1mmodule.api.module.users_endpoints.module.create_user.aws_api_gateway_integration_response.integration_response: Refreshing state... [id=agir-g3n6hchln8-xzg1re-POST-200][0m
[0m[1mmodule.api.module.oauth_endpoints.aws_iam_role_policy_attachment.generate_token_kms_attachment: Refreshing state... [id=generate-token-exec-20210526200628062500000005][0m
[0m[1mmodule.api.module.oauth_endpoints.aws_api_gateway_resource.authorize_ui_proxy: Refreshing state... [id=xnt33q][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_post_prod.aws_lambda_alias.alias: Refreshing state... [id=arn:aws:lambda:eu-west-2:784952278145:function:authorize:prod][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_post_test.aws_lambda_alias.alias: Refreshing state... [id=arn:aws:lambda:eu-west-2:784952278145:function:authorize:test][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_post_dev.aws_lambda_alias.alias: Refreshing state... [id=arn:aws:lambda:eu-west-2:784952278145:function:authorize:dev][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_post_test.aws_lambda_permission.permission: Refreshing state... [id=AllowAPIGatewayInvoke][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_post_prod.aws_lambda_permission.permission: Refreshing state... [id=AllowAPIGatewayInvoke][0m
[0m[1mmodule.api.module.oauth_endpoints.module.authorize_post_dev.aws_lambda_permission.permission: Refreshing state... [id=AllowAPIGatewayInvoke][0m
[0m[1mmodule.api.module.oauth_endpoints.aws_iam_role_policy_attachment.authorize_kms_attachment: Refreshing state... [id=authorize-exec-20210526200628114300000006][0m
[0m[1mmodule.api.module.oauth_endpoints.aws_api_gateway_method.authorize_ui_get: Refreshing state... [id=agm-g3n6hchln8-xnt33q-GET][0m
[0m[1mmodule.api.module.oauth_endpoints.aws_api_gateway_integration.authorize_ui_integration: Refreshing state... [id=agi-g3n6hchln8-xnt33q-GET][0m
[0m[1mmodule.api.module.oauth_endpoints.aws_api_gateway_method_response.authorize_ui_ok: Refreshing state... [id=agmr-g3n6hchln8-xnt33q-GET-200][0m
[0m[1mmodule.api.module.oauth_endpoints.aws_iam_policy.authorize_s3: Refreshing state... [id=arn:aws:iam::784952278145:policy/authorize-s3][0m
[0m[1mmodule.api.module.test_stage.aws_api_gateway_stage.stage: Refreshing state... [id=ags-g3n6hchln8-test][0m
[0m[1mmodule.api.module.dev_stage.aws_api_gateway_stage.stage: Refreshing state... [id=ags-g3n6hchln8-dev][0m
[0m[1mmodule.api.module.prod_stage.aws_api_gateway_stage.stage: Refreshing state... [id=ags-g3n6hchln8-prod][0m
[0m[1mmodule.api.module.oauth_endpoints.aws_api_gateway_integration_response.authorize_ui_response_integration: Refreshing state... [id=agir-g3n6hchln8-xnt33q-GET-200][0m
[0m[1mmodule.api.module.oauth_endpoints.aws_iam_role_policy_attachment.authorize_s3_attachment: Refreshing state... [id=authorize-ui-exec-20210530101132480800000001][0m
[0m
[1m[36mNote:[0m[1m Objects have changed outside of Terraform[0m

[0mTerraform detected the following changes made outside of Terraform since the
last "terraform apply":

[1m  # module.api.module.users_endpoints.module.create_user.aws_api_gateway_integration.integration[0m has been changed[0m[0m
[0m  [33m~[0m[0m resource "aws_api_gateway_integration" "integration" {
      [32m+[0m [0m[1m[0mcache_key_parameters[0m[0m    = []
        [1m[0mid[0m[0m                      = "agi-g3n6hchln8-xzg1re-POST"
      [32m+[0m [0m[1m[0mrequest_parameters[0m[0m      = {}
      [32m+[0m [0m[1m[0mrequest_templates[0m[0m       = {}
        [90m# (11 unchanged attributes hidden)[0m[0m
    }
[1m  # module.api.module.users_endpoints.module.create_user.aws_api_gateway_integration_response.integration_response[0m has been changed[0m[0m
[0m  [33m~[0m[0m resource "aws_api_gateway_integration_response" "integration_response" {
        [1m[0mid[0m[0m                  = "agir-g3n6hchln8-xzg1re-POST-200"
      [32m+[0m [0m[1m[0mresponse_parameters[0m[0m = {}
      [32m+[0m [0m[1m[0mresponse_templates[0m[0m  = {}
        [90m# (5 unchanged attributes hidden)[0m[0m
    }
[1m  # module.api.module.users_endpoints.module.create_user.aws_api_gateway_method.method[0m has been changed[0m[0m
[0m  [33m~[0m[0m resource "aws_api_gateway_method" "method" {
      [32m+[0m [0m[1m[0mauthorization_scopes[0m[0m = []
        [1m[0mid[0m[0m                   = "agm-g3n6hchln8-xzg1re-POST"
      [32m+[0m [0m[1m[0mrequest_models[0m[0m       = {}
      [32m+[0m [0m[1m[0mrequest_parameters[0m[0m   = {}
        [90m# (5 unchanged attributes hidden)[0m[0m
    }
[1m  # module.api.module.users_endpoints.module.create_user.aws_iam_policy.logging[0m has been changed[0m[0m
[0m  [33m~[0m[0m resource "aws_iam_policy" "logging" {
        [1m[0mid[0m[0m          = "arn:aws:iam::784952278145:policy/create-user-logging"
        [1m[0mname[0m[0m        = "create-user-logging"
      [32m+[0m [0m[1m[0mtags[0m[0m        = {}
        [90m# (6 unchanged attributes hidden)[0m[0m
    }
[1m  # module.api.module.users_endpoints.module.create_user.aws_iam_role.execution[0m has been changed[0m[0m
[0m  [33m~[0m[0m resource "aws_iam_role" "execution" {
        [1m[0mid[0m[0m                    = "create-user-exec"
      [33m~[0m [0m[1m[0mmanaged_policy_arns[0m[0m   = [
          [32m+[0m [0m"arn:aws:iam::784952278145:policy/create-user-logging",
          [32m+[0m [0m"arn:aws:iam::aws:policy/AmazonDynamoDBFullAccess",
        ]
        [1m[0mname[0m[0m                  = "create-user-exec"
      [32m+[0m [0m[1m[0mtags[0m[0m                  = {}
        [90m# (8 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
  [33m~[0m update in-place
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # module.api.module.oauth_endpoints.aws_api_gateway_integration.authorize_ui_integration[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_api_gateway_integration" "authorize_ui_integration" {
        [1m[0mid[0m[0m                      = "agi-g3n6hchln8-xnt33q-GET"
      [33m~[0m [0m[1m[0muri[0m[0m                     = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:784952278145:function:authorize-ui:${stageVariables.ENVIRONMENT}/invocations" [33m->[0m [0m"arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:784952278145:function:goidc-authorize-ui:${stageVariables.ENVIRONMENT}/invocations"
        [90m# (13 unchanged attributes hidden)[0m[0m
    }

[1m  # module.api.module.oauth_endpoints.module.authorize_get.aws_lambda_function.function[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lambda_function" "function" {
      [33m~[0m [0m[1m[0marn[0m[0m                            = "arn:aws:lambda:eu-west-2:784952278145:function:authorize-ui" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mfunction_name[0m[0m                  = "authorize-ui" [33m->[0m [0m"goidc-authorize-ui" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m                             = "authorize-ui" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minvoke_arn[0m[0m                     = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:784952278145:function:authorize-ui/invocations" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mlast_modified[0m[0m                  = "2021-06-01T09:02:52.760+0000" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mlayers[0m[0m                         = [] [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mqualified_arn[0m[0m                  = "arn:aws:lambda:eu-west-2:784952278145:function:authorize-ui:19" [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0msigning_job_arn[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msigning_profile_version_arn[0m[0m    = (known after apply)
      [33m~[0m [0m[1m[0msource_code_hash[0m[0m               = "FX956Z5jiFyBmY2N9HayVXFPw8LXma9jykbPOwYM16Y=" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0msource_code_size[0m[0m               = 6844170 [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mtags[0m[0m                           = {
          [32m+[0m [0m"goidc" = "yes"
        }
      [33m~[0m [0m[1m[0mtags_all[0m[0m                       = {
          [32m+[0m [0m"goidc" = "yes"
        }
      [33m~[0m [0m[1m[0mversion[0m[0m                        = "19" [33m->[0m [0m(known after apply)
        [90m# (10 unchanged attributes hidden)[0m[0m

      [33m~[0m [0mtracing_config {
          [33m~[0m [0m[1m[0mmode[0m[0m = "PassThrough" [33m->[0m [0m(known after apply)
        }
    }

[1m  # module.api.module.oauth_endpoints.module.authorize_get_dev.aws_lambda_alias.alias[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lambda_alias" "alias" {
      [33m~[0m [0m[1m[0marn[0m[0m              = "arn:aws:lambda:eu-west-2:784952278145:function:authorize-ui:dev" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mfunction_name[0m[0m    = "arn:aws:lambda:eu-west-2:784952278145:function:authorize-ui" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mfunction_version[0m[0m = "19" [33m->[0m [0m"$LATEST"
      [33m~[0m [0m[1m[0mid[0m[0m               = "arn:aws:lambda:eu-west-2:784952278145:function:authorize-ui:dev" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minvoke_arn[0m[0m       = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:784952278145:function:authorize-ui:dev/invocations" [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m             = "dev"
    }

[1m  # module.api.module.oauth_endpoints.module.authorize_get_dev.aws_lambda_permission.permission[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lambda_permission" "permission" {
      [33m~[0m [0m[1m[0mfunction_name[0m[0m = "authorize-ui" [33m->[0m [0m"goidc-authorize-ui" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m            = "AllowAPIGatewayInvoke" [33m->[0m [0m(known after apply)
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # module.api.module.oauth_endpoints.module.authorize_get_prod.aws_lambda_alias.alias[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lambda_alias" "alias" {
      [33m~[0m [0m[1m[0marn[0m[0m              = "arn:aws:lambda:eu-west-2:784952278145:function:authorize-ui:prod" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mfunction_name[0m[0m    = "arn:aws:lambda:eu-west-2:784952278145:function:authorize-ui" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mfunction_version[0m[0m = "5" [33m->[0m [0m"$LATEST"
      [33m~[0m [0m[1m[0mid[0m[0m               = "arn:aws:lambda:eu-west-2:784952278145:function:authorize-ui:prod" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minvoke_arn[0m[0m       = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:784952278145:function:authorize-ui:prod/invocations" [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m             = "prod"
    }

[1m  # module.api.module.oauth_endpoints.module.authorize_get_prod.aws_lambda_permission.permission[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lambda_permission" "permission" {
      [33m~[0m [0m[1m[0mfunction_name[0m[0m = "authorize-ui" [33m->[0m [0m"goidc-authorize-ui" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m            = "AllowAPIGatewayInvoke" [33m->[0m [0m(known after apply)
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # module.api.module.oauth_endpoints.module.authorize_get_test.aws_lambda_alias.alias[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lambda_alias" "alias" {
      [33m~[0m [0m[1m[0marn[0m[0m              = "arn:aws:lambda:eu-west-2:784952278145:function:authorize-ui:test" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mfunction_name[0m[0m    = "arn:aws:lambda:eu-west-2:784952278145:function:authorize-ui" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mfunction_version[0m[0m = "19" [33m->[0m [0m"$LATEST"
      [33m~[0m [0m[1m[0mid[0m[0m               = "arn:aws:lambda:eu-west-2:784952278145:function:authorize-ui:test" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minvoke_arn[0m[0m       = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:784952278145:function:authorize-ui:test/invocations" [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m             = "test"
    }

[1m  # module.api.module.oauth_endpoints.module.authorize_get_test.aws_lambda_permission.permission[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lambda_permission" "permission" {
      [33m~[0m [0m[1m[0mfunction_name[0m[0m = "authorize-ui" [33m->[0m [0m"goidc-authorize-ui" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m            = "AllowAPIGatewayInvoke" [33m->[0m [0m(known after apply)
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # module.api.module.oauth_endpoints.module.authorize_post.aws_lambda_function.function[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lambda_function" "function" {
      [33m~[0m [0m[1m[0marn[0m[0m                            = "arn:aws:lambda:eu-west-2:784952278145:function:authorize" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mfunction_name[0m[0m                  = "authorize" [33m->[0m [0m"goidc-authorize" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m                             = "authorize" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minvoke_arn[0m[0m                     = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:784952278145:function:authorize/invocations" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mlast_modified[0m[0m                  = "2021-06-01T09:02:40.430+0000" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mlayers[0m[0m                         = [] [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mqualified_arn[0m[0m                  = "arn:aws:lambda:eu-west-2:784952278145:function:authorize:22" [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0msigning_job_arn[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msigning_profile_version_arn[0m[0m    = (known after apply)
      [33m~[0m [0m[1m[0msource_code_hash[0m[0m               = "8q1WZiqJvdJOoMAi2A/GM7IQKU1AvdZJEBAp8nGwzB8=" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0msource_code_size[0m[0m               = 6825842 [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mtags[0m[0m                           = {
          [32m+[0m [0m"goidc" = "yes"
        }
      [33m~[0m [0m[1m[0mtags_all[0m[0m                       = {
          [32m+[0m [0m"goidc" = "yes"
        }
      [33m~[0m [0m[1m[0mversion[0m[0m                        = "22" [33m->[0m [0m(known after apply)
        [90m# (10 unchanged attributes hidden)[0m[0m

      [33m~[0m [0mtracing_config {
          [33m~[0m [0m[1m[0mmode[0m[0m = "PassThrough" [33m->[0m [0m(known after apply)
        }
    }

[1m  # module.api.module.oauth_endpoints.module.authorize_post_dev.aws_lambda_alias.alias[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lambda_alias" "alias" {
      [33m~[0m [0m[1m[0marn[0m[0m              = "arn:aws:lambda:eu-west-2:784952278145:function:authorize:dev" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mfunction_name[0m[0m    = "arn:aws:lambda:eu-west-2:784952278145:function:authorize" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mfunction_version[0m[0m = "22" [33m->[0m [0m"$LATEST"
      [33m~[0m [0m[1m[0mid[0m[0m               = "arn:aws:lambda:eu-west-2:784952278145:function:authorize:dev" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minvoke_arn[0m[0m       = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:784952278145:function:authorize:dev/invocations" [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m             = "dev"
    }

[1m  # module.api.module.oauth_endpoints.module.authorize_post_dev.aws_lambda_permission.permission[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lambda_permission" "permission" {
      [33m~[0m [0m[1m[0mfunction_name[0m[0m = "authorize" [33m->[0m [0m"goidc-authorize" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m            = "AllowAPIGatewayInvoke" [33m->[0m [0m(known after apply)
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # module.api.module.oauth_endpoints.module.authorize_post_prod.aws_lambda_alias.alias[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lambda_alias" "alias" {
      [33m~[0m [0m[1m[0marn[0m[0m              = "arn:aws:lambda:eu-west-2:784952278145:function:authorize:prod" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mfunction_name[0m[0m    = "arn:aws:lambda:eu-west-2:784952278145:function:authorize" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mfunction_version[0m[0m = "4" [33m->[0m [0m"$LATEST"
      [33m~[0m [0m[1m[0mid[0m[0m               = "arn:aws:lambda:eu-west-2:784952278145:function:authorize:prod" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minvoke_arn[0m[0m       = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:784952278145:function:authorize:prod/invocations" [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m             = "prod"
    }

[1m  # module.api.module.oauth_endpoints.module.authorize_post_prod.aws_lambda_permission.permission[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lambda_permission" "permission" {
      [33m~[0m [0m[1m[0mfunction_name[0m[0m = "authorize" [33m->[0m [0m"goidc-authorize" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m            = "AllowAPIGatewayInvoke" [33m->[0m [0m(known after apply)
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # module.api.module.oauth_endpoints.module.authorize_post_test.aws_lambda_alias.alias[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lambda_alias" "alias" {
      [33m~[0m [0m[1m[0marn[0m[0m              = "arn:aws:lambda:eu-west-2:784952278145:function:authorize:test" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mfunction_name[0m[0m    = "arn:aws:lambda:eu-west-2:784952278145:function:authorize" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mfunction_version[0m[0m = "22" [33m->[0m [0m"$LATEST"
      [33m~[0m [0m[1m[0mid[0m[0m               = "arn:aws:lambda:eu-west-2:784952278145:function:authorize:test" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minvoke_arn[0m[0m       = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:784952278145:function:authorize:test/invocations" [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m             = "test"
    }

[1m  # module.api.module.oauth_endpoints.module.authorize_post_test.aws_lambda_permission.permission[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lambda_permission" "permission" {
      [33m~[0m [0m[1m[0mfunction_name[0m[0m = "authorize" [33m->[0m [0m"goidc-authorize" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m            = "AllowAPIGatewayInvoke" [33m->[0m [0m(known after apply)
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # module.api.module.oauth_endpoints.module.generate_token.aws_lambda_function.function[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lambda_function" "function" {
      [33m~[0m [0m[1m[0marn[0m[0m                            = "arn:aws:lambda:eu-west-2:784952278145:function:generate-token" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mfunction_name[0m[0m                  = "generate-token" [33m->[0m [0m"goidc-generate-token" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m                             = "generate-token" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minvoke_arn[0m[0m                     = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:784952278145:function:generate-token/invocations" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mlast_modified[0m[0m                  = "2021-06-01T10:11:47.413+0000" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mlayers[0m[0m                         = [] [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mqualified_arn[0m[0m                  = "arn:aws:lambda:eu-west-2:784952278145:function:generate-token:33" [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0msigning_job_arn[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msigning_profile_version_arn[0m[0m    = (known after apply)
      [33m~[0m [0m[1m[0msource_code_hash[0m[0m               = "coh/B6TKsT7mGs4m5ikfzIvkuHb5OnQJC7IjaJa9QCM=" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0msource_code_size[0m[0m               = 6745838 [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mtags[0m[0m                           = {
          [32m+[0m [0m"goidc" = "yes"
        }
      [33m~[0m [0m[1m[0mtags_all[0m[0m                       = {
          [32m+[0m [0m"goidc" = "yes"
        }
      [33m~[0m [0m[1m[0mversion[0m[0m                        = "33" [33m->[0m [0m(known after apply)
        [90m# (10 unchanged attributes hidden)[0m[0m

      [33m~[0m [0mtracing_config {
          [33m~[0m [0m[1m[0mmode[0m[0m = "PassThrough" [33m->[0m [0m(known after apply)
        }
    }

[1m  # module.api.module.oauth_endpoints.module.generate_token_dev.aws_lambda_alias.alias[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lambda_alias" "alias" {
      [33m~[0m [0m[1m[0marn[0m[0m              = "arn:aws:lambda:eu-west-2:784952278145:function:generate-token:dev" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mfunction_name[0m[0m    = "arn:aws:lambda:eu-west-2:784952278145:function:generate-token" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mfunction_version[0m[0m = "33" [33m->[0m [0m"$LATEST"
      [33m~[0m [0m[1m[0mid[0m[0m               = "arn:aws:lambda:eu-west-2:784952278145:function:generate-token:dev" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minvoke_arn[0m[0m       = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:784952278145:function:generate-token:dev/invocations" [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m             = "dev"
    }

[1m  # module.api.module.oauth_endpoints.module.generate_token_dev.aws_lambda_permission.permission[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lambda_permission" "permission" {
      [33m~[0m [0m[1m[0mfunction_name[0m[0m = "generate-token" [33m->[0m [0m"goidc-generate-token" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m            = "AllowAPIGatewayInvoke" [33m->[0m [0m(known after apply)
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # module.api.module.oauth_endpoints.module.generate_token_prod.aws_lambda_alias.alias[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lambda_alias" "alias" {
      [33m~[0m [0m[1m[0marn[0m[0m              = "arn:aws:lambda:eu-west-2:784952278145:function:generate-token:prod" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mfunction_name[0m[0m    = "arn:aws:lambda:eu-west-2:784952278145:function:generate-token" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mfunction_version[0m[0m = "17" [33m->[0m [0m"$LATEST"
      [33m~[0m [0m[1m[0mid[0m[0m               = "arn:aws:lambda:eu-west-2:784952278145:function:generate-token:prod" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minvoke_arn[0m[0m       = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:784952278145:function:generate-token:prod/invocations" [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m             = "prod"
    }

[1m  # module.api.module.oauth_endpoints.module.generate_token_prod.aws_lambda_permission.permission[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lambda_permission" "permission" {
      [33m~[0m [0m[1m[0mfunction_name[0m[0m = "generate-token" [33m->[0m [0m"goidc-generate-token" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m            = "AllowAPIGatewayInvoke" [33m->[0m [0m(known after apply)
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # module.api.module.oauth_endpoints.module.generate_token_test.aws_lambda_alias.alias[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lambda_alias" "alias" {
      [33m~[0m [0m[1m[0marn[0m[0m              = "arn:aws:lambda:eu-west-2:784952278145:function:generate-token:test" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mfunction_name[0m[0m    = "arn:aws:lambda:eu-west-2:784952278145:function:generate-token" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mfunction_version[0m[0m = "33" [33m->[0m [0m"$LATEST"
      [33m~[0m [0m[1m[0mid[0m[0m               = "arn:aws:lambda:eu-west-2:784952278145:function:generate-token:test" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minvoke_arn[0m[0m       = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:784952278145:function:generate-token:test/invocations" [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m             = "test"
    }

[1m  # module.api.module.oauth_endpoints.module.generate_token_test.aws_lambda_permission.permission[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lambda_permission" "permission" {
      [33m~[0m [0m[1m[0mfunction_name[0m[0m = "generate-token" [33m->[0m [0m"goidc-generate-token" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m            = "AllowAPIGatewayInvoke" [33m->[0m [0m(known after apply)
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # module.api.module.users_endpoints.module.create_user.aws_lambda_function.function[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_lambda_function" "function" {
      [32m+[0m [0m[1m[0marn[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mfunction_name[0m[0m                  = "goidc-create-user"
      [32m+[0m [0m[1m[0mhandler[0m[0m                        = "main"
      [32m+[0m [0m[1m[0mid[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0minvoke_arn[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mlast_modified[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mmemory_size[0m[0m                    = 128
      [32m+[0m [0m[1m[0mpackage_type[0m[0m                   = "Zip"
      [32m+[0m [0m[1m[0mpublish[0m[0m                        = true
      [32m+[0m [0m[1m[0mqualified_arn[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mreserved_concurrent_executions[0m[0m = -1
      [32m+[0m [0m[1m[0mrole[0m[0m                           = "arn:aws:iam::784952278145:role/create-user-exec"
      [32m+[0m [0m[1m[0mruntime[0m[0m                        = "go1.x"
      [32m+[0m [0m[1m[0ms3_bucket[0m[0m                      = "goidc"
      [32m+[0m [0m[1m[0ms3_key[0m[0m                         = "sampleapp.zip"
      [32m+[0m [0m[1m[0msigning_job_arn[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msigning_profile_version_arn[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0msource_code_hash[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0msource_code_size[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                           = {
          [32m+[0m [0m"goidc" = "yes"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                       = {
          [32m+[0m [0m"goidc" = "yes"
        }
      [32m+[0m [0m[1m[0mtimeout[0m[0m                        = 15
      [32m+[0m [0m[1m[0mversion[0m[0m                        = (known after apply)

      [32m+[0m [0mtracing_config {
          [32m+[0m [0m[1m[0mmode[0m[0m = (known after apply)
        }
    }

[1m  # module.api.module.users_endpoints.module.create_user_dev.aws_lambda_alias.alias[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_lambda_alias" "alias" {
      [32m+[0m [0m[1m[0marn[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mfunction_name[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mfunction_version[0m[0m = "$LATEST"
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0minvoke_arn[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m             = "dev"
    }

[1m  # module.api.module.users_endpoints.module.create_user_dev.aws_lambda_permission.permission[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_lambda_permission" "permission" {
      [32m+[0m [0m[1m[0maction[0m[0m        = "lambda:InvokeFunction"
      [32m+[0m [0m[1m[0mfunction_name[0m[0m = "goidc-create-user"
      [32m+[0m [0m[1m[0mid[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprincipal[0m[0m     = "apigateway.amazonaws.com"
      [32m+[0m [0m[1m[0mqualifier[0m[0m     = "dev"
      [32m+[0m [0m[1m[0msource_arn[0m[0m    = "arn:aws:execute-api:eu-west-2:784952278145:g3n6hchln8/*/*"
      [32m+[0m [0m[1m[0mstatement_id[0m[0m  = "AllowAPIGatewayInvoke"
    }

[1m  # module.api.module.users_endpoints.module.create_user_prod.aws_lambda_alias.alias[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_lambda_alias" "alias" {
      [32m+[0m [0m[1m[0marn[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mfunction_name[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mfunction_version[0m[0m = "$LATEST"
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0minvoke_arn[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m             = "prod"
    }

[1m  # module.api.module.users_endpoints.module.create_user_prod.aws_lambda_permission.permission[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_lambda_permission" "permission" {
      [32m+[0m [0m[1m[0maction[0m[0m        = "lambda:InvokeFunction"
      [32m+[0m [0m[1m[0mfunction_name[0m[0m = "goidc-create-user"
      [32m+[0m [0m[1m[0mid[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprincipal[0m[0m     = "apigateway.amazonaws.com"
      [32m+[0m [0m[1m[0mqualifier[0m[0m     = "prod"
      [32m+[0m [0m[1m[0msource_arn[0m[0m    = "arn:aws:execute-api:eu-west-2:784952278145:g3n6hchln8/*/*"
      [32m+[0m [0m[1m[0mstatement_id[0m[0m  = "AllowAPIGatewayInvoke"
    }

[1m  # module.api.module.users_endpoints.module.create_user_test.aws_lambda_alias.alias[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_lambda_alias" "alias" {
      [32m+[0m [0m[1m[0marn[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mfunction_name[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mfunction_version[0m[0m = "$LATEST"
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0minvoke_arn[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m             = "test"
    }

[1m  # module.api.module.users_endpoints.module.create_user_test.aws_lambda_permission.permission[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_lambda_permission" "permission" {
      [32m+[0m [0m[1m[0maction[0m[0m        = "lambda:InvokeFunction"
      [32m+[0m [0m[1m[0mfunction_name[0m[0m = "goidc-create-user"
      [32m+[0m [0m[1m[0mid[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprincipal[0m[0m     = "apigateway.amazonaws.com"
      [32m+[0m [0m[1m[0mqualifier[0m[0m     = "test"
      [32m+[0m [0m[1m[0msource_arn[0m[0m    = "arn:aws:execute-api:eu-west-2:784952278145:g3n6hchln8/*/*"
      [32m+[0m [0m[1m[0mstatement_id[0m[0m  = "AllowAPIGatewayInvoke"
    }

[0m[1mPlan:[0m 28 to add, 1 to change, 21 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @reecerussell, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*